# -*- mode: ruby -*-
# vi: set ft=ruby :

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "hashicorp/tap"
tap "saguarospace/saguarospace"

# Saguaro Space
brew "typescript-language-server"
brew "vls"
brew "vscode-css-languageserver"
brew "jedi-language-server"

# Hashicorp
cask "vagrant"
cask "vagrant-vmware-utility"
brew "terraform"
brew "packer"

# Packages
brew "pass"
brew "stow"
brew "jq"
brew "ffmpeg"
brew "imagemagick"
brew "potrace"
brew "awscli"
brew "pandoc"
brew "tree"
brew "fzf"
brew "minikube"
brew "fossil"
brew "nmap"
brew "emacs"
brew "scipy"
brew "poetry"
brew "jupyterlab"
brew "graphviz"
brew "lilypond"
brew "black"
brew "flake8"
brew "prettier"
brew "mermaid-cli"
brew "cloudflare-wrangler"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Languages
brew "node@14"
brew "python@3.10"
brew "ruby"
brew "go"

# Apps
cask "ngrok"
cask "bbedit"
cask "hype"
cask "firefox"
cask "google-chrome"
cask "devonthink"
cask "omnigraffle"
cask "affinity-photo"
cask "affinity-designer"
cask "affinity-publisher"
cask "mactex-no-gui"
cask "filemaker-pro"
cask "vmware-fusion-tech-preview"
