# -*- mode: ruby -*-
# vi: set ft=ruby :

# To install these dependencies, run `brew bundle`

tap "homebrew/cask"
tap "hashicorp/tap"

# Hashicorp
cask "vagrant"
brew "terraform"
brew "packer"

# Helper tools
brew "stow"
brew "jq"
brew "ffmpeg"
brew "imagemagick"
brew "potrace"
brew "awscli"
brew "pandoc"
brew "minikube"
brew "podman"
brew "fossil"
brew "nmap"
brew "emacs"
brew "scipy"
brew "poetry"
brew "jupyterlab"
brew "graphviz"
brew "lilypond"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Languages
brew "node@14"
brew "python@3.9"
brew "ruby"
brew "go"

# Apps
cask "ngrok"
cask "multipass"
cask "nova"
cask "transmit"
cask "microsoft-edge"
cask "affinity-photo"
cask "affinity-designer"
cask "affinity-publisher"
cask "mactex-no-gui"
cask "filemaker-pro"
